import React from 'react';
import '../css/Shoshi.css'; // Make sure to create and link the CSS file for styling
import shoshiPortrait from '../images/shoshi_chayat_portrait.jpg';

function Shoshi() {
  return (
    <div className="shoshi-container">
      <div className="shoshi-content">
        <div className="image-container">
          <img src={shoshiPortrait} alt="Shoshi Khayat" className="shoshi-image" />
        </div>
        <div className="text-container">
          <h1>שושי חייט</h1>
          <h2>ביוגרפיה</h2>
          <p>נולדה למשפחת גולדמן, דור שני לשואה בעיר קלוז' בטרנסליבניה, רומניה. בשנת 1950 עלתה לישראל. חיי ילדותה ונערותה היו קשים מנשוא היות שאביה נטש אותה בהיותה תינוקת ואמה התאבדה כשהייתה נערה בת 12. ובשנת 1964 נישאה לצייר יעקב חייט. לזוג שתי בנות.</p>
          
          <h2>לימודים</h2>
          <p>1961-1964 - לימודי אמנות בויצו צרפת. בין מוריה היו היוצרים: אלכסנדר בוגן, שמואל טפלר, משה רוזנטליס, ויצחק יורש.</p>
          <p>1984-1986 - לימודי פיסול במכון לאמנות בבת-ים. מורה ראשי: הפסל יעקב אפשטיין.</p>
          
          <h2>סגנון היצירה</h2>
          <p>בחייט דבק הכינוי 'ציירת הליצנים', משום שהדמויות האנושיות בציוריה עוטות על פניהן לרוב מסכה. סימטריה, שקט, סמכותיות ושלוות צבע עבדו אצל הציירת כמין בולם זעזועים מפני רקמת המציאות הקשה. חייט אפשרה ביצירותיה למצוא גוונים רבים ולעיתים הניחה רק לשחור וללבן, הפשוטים לכאורה של העיפרון, להעניק הבעות אנושיות מגוונות כחכמה, תמימות, ערמומיות ואומללות.</p>
          
          <p>בין יצירותיה הטריפטיכון, המשקף את מסכת חייה הקשים של האמנית כבר מילדותה, שהטילה אותה כהגדרתה, וכשם היצירה, אל זירת קרקס החיים של שושי. בכוח אישיותה, בדומה למסכה שביצירותיה, היא עוטה על רגשותיה מעטה בדמוי של 'רומנטיקת קרקסים', ובכך מרחיקה את הצופה מן ההליכה על חבל הזכרונות הדק האישי שלה.</p>
          
          <p>אף על פי שהעיסוק בדמות הליצן מאפשר זאת, קשה למצוא בעבודותיה פארסה, בוטות או סלפסטיק לשמו, שכן דומה כי מרבית הדמויות, לרבות הפסלים שיצרה, נושאות בנטל של סבילות.</p>
          
          <p>דוגמה לשימוש בלקסיקון הלולייני החזותי של היוצרת הייתה נוכחת ביצירת סדרת ציורי התנ"ך שיצרה, שבה הדמויות המסורתיות לובשות על פניהן מסכות של ליצנים. מתוך הסדרה בולט ציור בשם "טרוף טורף יוסף" (מתוך מעמד כתונת הפסים לאחר מכירתו של יוסף לישמעאלים), המהווה כמשל וכנמשל מרחשי ליבה וסיפורה האישי.</p>
          
          <p>באחד הראיונות שנתנה לתקשורת הסבירה את עומק יצירתה ואת ההקשר לדמויות הליצנים:</p>
          <blockquote>
            <p>"אני משתמשת בדמותו של הליצן כדי להמחיש את מורכבות האדם ואת הצורך שלו להסתתר מאחורי מסכות. ליצן הוא אדם שעוטה על פניו מסכה, כולנו עוטים על פנינו מסכות. רוב שעות היום אנחנו מכסים את האמת במסכות כדי להתאים את עצמנו לסביבה. הליצן הוא אני, ומזה אני לא יכולה לברוח".</p>
          </blockquote>
        </div>
      </div>
    </div>
  );
}

export default Shoshi;
